[
    {
        "id": 1,
        "name": "Marvel's Spider-Man (Spider-Punk Suit) 1/6 Scale Collectible Figure",
        "character":"Spider-Man",
        "description":"Spiderman wearing a jean vest and holding a guitar",
        "details": "Meticulously crafted based on the Spider-Punk suit from the Marvel’s Spider-Man video game, this collectible figure features a newly developed masked head sculpt with a spike Mohawk and three pairs of interchangeable eye pieces to create different combinations of Spider-Man’s expressions; a newly developed body; a skillfully tailored Spider-Punk suit complete with greatly detailed patterns and denim vest with real-like pins and spikes; interchangeable hands for different postures; a guitar; Spider-Drone; a variety of web accessories; and a stylishly designed figure stand!",
        "price": 234.99,
        "Instock": true,
        "collections":["Marvel","Hot Toys"],
        "features":["11.80 inches (30cm)","Made of plastic","Based on Marvel’s Spider-Man game","A newly developed masked head sculpt with spike Mohawk","Newly developed body with over 30 points of articulations"],
        "contents":["Spider-Man figure","Newly developed white, red and blue colored Spider-Punk suit","Blue denim vest with real-like pins and spikes on the back","Pair of red and white sneakers","Spider web effect accessory","Spider-Drone"],
        "portrait_image":"/images/PunkSpidermanPortrait.jpg",
        "landscape_image":"/images/PunkSpidermanAction.jpg",
        "square_image":"/images/PunkSpidermanSquare.png"
    },
    {
        "id": 2,
        "name": "Toy Story Legacy of Revoltech KD-061 Woody (Ver. 1.5)",
        "character":"Woody",
        "description":"A posable figure of Woody From Toy Story",
        "details": "Toy Story's Woody returns to the Legacy of Revoltech series! Measuring around 6 inches tall, he features 17 points of articulation, different facial expressions, a hand part for the separately-sold Buzz Lightyear figure, a Squeeze Toy Alien figure, a mic, and Lenny the Binoculars figure to recreate scenes from the classic animated film.",
        "price": 79.99,
        "Instock": true,
        "collections":["Disney","Pixar"],
        "features":["5.9 inches (15cm)","Made of PVC and ABS","From the Toy Story animated movies","Part of the Legacy of Revoltech series","Features 17 points of articulation, facial expressions, and other toy accessories"],
        "contents":["Woody figure","Cowboy hat","4 Face plates","Optional hand for Buzz Lightyear figure (sold separately)","Squeeze Toy Alien figure","Squeeze Toy Alien figure","Lenny the Binoculars","Mic"],
        "portrait_image":"/images/WoodyPortrait.jpg",
        "landscape_image":"/images/WoodyLandscape.jpg",
        "square_image":"/images/WoodySquare.jpg"
    },
    {
        "id": 3,
        "name": "Transformers MDLX Articulated Figures Series Optimus Prime",
        "character":"Optimus Prime",
        "description":"An Optimus Prime toy that doesn't transform",
        "details": "The Transformers MDLX Optimus Prime measures 7 inches tall, with approximately 48 points of articulation and a die-cast metal frame. Accessories include an Ion Blaster, Energon Axe, Autobot Matrix of Leadership, and five pairs of interchangeable hands.The Transformers MDLX line of figures is based on the original 1980s The Transformers cartoon and toy line, as redesigned by threezero Art Director Kelvin Sau. The iconic designs have been remixed to incorporate threezero's hyper-detailed mechanical aesthetic, offering a familiar and exciting new presentation.",
        "price": 79.99,
        "Instock": true,
        "collections":["Hasbro","Transformers"],
        "features":["7.01 inches (17.8cm)","Made of ABS, PVC, POM, zinc alloy and die-cast metal parts","Officially licensed","48 Points of articulation","Part of the MDLX Small Scale Articulated Figures series"],
        "contents":["Optimus Prime figure","Ion Blaster","Energon Axe","Autobot Matrix of Leadership","5 Pairs of interchangeable hands"],
        "portrait_image":"/images/OptimusPrime.jpg",
        "landscape_image":"/images/OptimusPrimeLandscape.jpg"
    },
    {
        "id": 4,
        "name": "Star Wars Darth Vader (Return of The Jedi) 1/6 Scale Figure",
        "character":"Darth Vader",
        "description":"A Detailed Darth Vader Figure",
        "details": "Recreate every memorable scene with this Sideshow Collectibles Star Wars Darth Vader 1/6th Scale figure, featuring newly sculpted elements, new costume, a new lightsaber blade and our hexagonal figure base. Crafted on a fully articulated body with finely tailored costume and body armor elements, Star Wars fans don't miss your chance to add this Sith Lord to your most impressive collection!",
        "price": 259.99,
        "Instock": true,
        "collections":["Star Wars"],
        "features":["1/6 Scale","Made of plastic and fabric","Featuring Newly Sculpted Elements","New Lightsaber Blade","Hexagonal Figure Base","Hexagonal Figure Base","Finely Tailored Costume"],
        "contents":["Darth Vader figure","Lightsaber hilt without blade","Lightsaber hilt with attached blade","8 Interchangeable hands","Hexagonal shaped figure stand"],
        "portrait_image":"/images/DarthVader.png",
        "landscape_image":"/images/DarthVaderLandscape.png"
    },
    {
        "id": 5,
        "name": "Mighty Morphin Power Rangers Ultimates Red Ranger Figure",
        "character":"Red Power Ranger",
        "description":"A Red Power Ranger Action Figure",
        "details": "Whether it’s Jason Scott Lee or Rocky DeSantos, the Mighty Morphin Red Ranger has the martial arts chopsto cut Rita Repulsa and her evil minions down to size! This 7-inch scale fully articulated Mighty Morphin Power Rangers ULTIMATES! Red Ranger figure features multiple interchangeable heads and hands along with highly detailed accessories, including the Dragon Dagger, Red Power Crystal, and more!",
        "price": 54.99,
        "Instock": true,
        "collections":["Power Rangers"],
        "features":["7-inch scale (17.78cm)","Made of plastic","Based on the Mighty Morphin Power Rangers series","Incredibly detailed action figures with signature accessories","Comes in window box packaging with aRemovable Dragon Dagger holster","Pair of interchangeable arms (Dragon Shield)"],
        "portrait_image":"/images/RedRanger.png",
        "landscape_image":"/images/RedRangerLandscape.png"
    },    
    {
        "id": 6,
        "name": "Batman ArtFX+ 1/6 Scale Statue",
        "character":"Batman",
        "description":"A Batman Statue",
        "details": "Batman appears in his blue costume from the story standing at just about 30cm tall! Batman’s muscular silhouette is poised and ready to fight against crime. His presence fully encapsulates the essence of Gotham City’s Dark Knight! Batman stands firmly upon a metal base printed with a bat logo thanks to the magnets embedded in the figure’s feet.This statue comes easy to assemble and would look good in any collection.",
        "price": 119.99,
        "Instock": true,
        "collections":["Batman","DC Comics"],
        "features":["11.02 inches (28cm)","Made of PVC","Based on the Batman: Hush comics","Includes Metal base printed with the bat logo"],
        "contents":["Batman statue","Base"],
        "portrait_image":"/images/Batman.png",
        "landscape_image":"/images/BatmanLandscape.png"
    },    
    {
        "id": 7,
        "name": "Luigi's Mansion 3 Luigi Statue",
        "character":"Luigi",
        "description":"A Statue of a scared Luigi",
        "details": "From the Luigi's Mansion series, First 4 Figures is proud to introduce the Luigi 9 inch PVC statue. The character design is based on the 3rd installment of the Luigi's Mansion franchise.",
        "price": 79.99,
        "Instock": true,
        "collections":["Nintendo","Super Mario Brothers"],
        "features":["9 inches (22.86cm)","Made of PVC","From Luigi's Mansion 3 ","Highly detailed"],
        "contents":["Luigi Statue"],
        "portrait_image":"/images/Luigi.png",
        "landscape_image":"/images/LuigiLandscape.png"
    },    
    {
        "id": 8,
        "name": "Marvel One:12 Collective Wolverine",
        "character":"Wolverine",
        "description":"Wolverine Action Figure",
        "details": "This One:12 Collective Mezco Wolverine figure features a newly developed body accurately depicting his build. The brown and yellow Wolverine action figure also features over 30 points of articulation, 2 heads, hand painted authentic details, 6 interchangeable hands, weapons and accessories, and real fabric clothing. Pose and display him on his included stand and logo base for an incredible sight in your Marvel collection!",
        "price": 80.00,
        "Instock": true,
        "collections":["Marvel"],
        "features":["5.9 inches (15cm)","1/12 scale","From the Marvel series","Featuring Wolverine as an articulated figure","Includes 2 heads, 6 hands, weapons, accessories, fabric clothing, and stand with a themed-base","Comes in deluxe collector-friendly packaging"],
        "contents":["One:12 Collective Wolverine figure","2 head sculpts","6 interchangeable hands","Costume","Muramasa katana","Stand with logo base"],
        "portrait_image":"/images/Wolverine.png",
        "landscape_image":"/images/WolverineLandscape.png"
    },    
    {
        "id": 9,
        "name": "TMNT Ultimates Undercover Raphael",
        "character":"Raphael",
        "description":"A Ninja Turtle in a Trench Coat",
        "details": "It doesn’t matter if it’s one of Shredder’s plots or a stack of fresh pizzas, the Teenage Mutant Ninja Turtles ULTIMATES! Undercover Raphael figure is going to get to the bottom of it! This BigBadToyStore exclusive 7” scale fully articulated Undercover Raphael figure features premium detail and comes with interchangeable heads and hands and over 10 additional Ninja Turtle sleuthing accessories, including a soft goods trench coat. It’s no mystery why you’re going to want to add the Teenage Mutant Ninja Turtles ULTIMATES! Undercover Raphael figure to your collection, but get yours quick before this limited edition figure is gone without a trace! ",
        "price": 54.99,
        "Instock": true,
        "collections":["Teenage Mutant Ninja Turtles"],
        "features":["7-inch scale (17.78cm)","Made of plastic","Part of the Ultimates figure line","Includes a variety of accessories"],
        "contents":["Raphael figure","2 Interchangeable heads","10 Interchangeable hands","2 Spy Sais","2 Ninja stars","Night vision goggles","Private eye pistol","Super sensitive eavesdroppin' dish","TV Camera","Tripod","Meat lovers pizza slice","Soft goods trench coat","Surveillance spy case with stickers"],
        "portrait_image":"/images/NinjaTurtle.png",
        "landscape_image":"/images/NinjaTurtleLandscape.png"
    },  
    {
        "id": 10,
        "name": "Final Fantasy VII Remake Play Arts Kai Cloud Strife",
        "character":"Cloud Strife",
        "description":"A detailed figure of Cloud from Final Fantasy 7",
        "details": "From the Final Fantasy VII Remake game, Cloud Strife joins the fray once again as a Play Arts Kai action figure! Standing over 10 inches tall, this new version of Cloud comes with an updated face sculpt, based on the in-game 3D model. Square Enix focused on the sculpt and paintwork to showcase all the subtle details, from Cloud’s confident expression, to his glimmering earring, and to the coloring of his eyes in this exquisite figure.",
        "price": 154.99,
        "Instock": true,
        "collections":["Final Fantasy"],
        "features":["10.60 inches (27cm)","Made of plastic","From Final Fantasy VII Remake","Updated sculpt on the face","Based on the in-game 3D model"],
        "contents":["Cloud Strife figure","8 Hands","Buster Sword","Stand","Joint"],
        "portrait_image":"/images/Cloud.png",
        "landscape_image":"/images/CloudLandscape.png"
    },    
    {
        "id": 11,
        "name": "Avengers: Endgame MMS548 Rocket 1/6th Scale Collectible Figure",
        "character":"Rocket Raccoon",
        "description":"A figure of Rocket Raccoon wearing a scarf",
        "details": "Based on the unique physique of Rocket in the movie Avengers: Endgame, the figure features a newly painted head portraying his roaring expression with a striking likeness, meticulously tailored costume with interchangeable scarves, a number of interchangeable hands, pistols and blasters, highly-detailed accessories including a 1/6th scale Nano Gauntlet, a pair of goggles, an Aether extraction, also a specially designed dynamic figure with movie logo.",
        "price": 211.99,
        "Instock": true,
        "collections":["Marvel","Hot Toys"],
        "features":["6.30 inches (16cm)","Made of plastic","Authentic and detailed likeness of Rocket from Avengers: Endgame","Newly developed specialized body with over 20 points of articulation","Newly painted roaring expression head sculpt"],
        "contents":["Rocket figure","5 Pieces of interchangeable gloved hands","Grayish blue space suit","Utility belt with pouches","Burgundy colored scarf","Burgundy colored fabric scarf","Pair of grayish blue colored boots","2 Pistols","2 Blasters","Nano Gauntlet","Pair of goggles","Aether extraction"],
        "portrait_image":"/images/RocketRaccoon.png",
        "landscape_image":"/images/RocketRaccoonLandscape.png"
    },
    {
        "id": 12,
        "name": "Horizon Forbidden West Nendoroid No.1850 Aloy",
        "character":"Aloy",
        "description":"A Chibi Figure of Aloy from Horizon: Zero Dawn",
        "details": "From the PlayStation game Horizon Forbidden West comes a Nendoroid of the main character Aloy! She comes with three face plates including a standard face, a combat face, and an aiming face. Optional parts include a spear, a bow and arrow, a Focus effect part, and a Watcher miniature figure. Be sure to add this adorable Nendoroid of Aloy to your collection!",
        "price": 61.99,
        "Instock": true,
        "collections":["Good Smile","Horizon Zero Dawn"],
        "features":["3.9 inches (10cm)","Made of plastic","Based on the Horizon Forbidden West video game","Part of the Nendoroid lineup"],
        "contents":["Aloy figure", "3 Face plates","Spear","Bow and arrow","Focus effect part","Watcher mini figure",""],
        "portrait_image":"/images/Aloy.png",
        "landscape_image":"/images/AloyLandscape.png"
    },
    {
        "id": 13,
        "name": "The Legend of Zelda: Skyward Sword Link 1/7 Scale Figure",
        "character":"Link",
        "description":"A Statue of Link from The Legend of Zelda",        
        "details": "From the classic action-adventure game The Legend of Zelda: Skyward Sword comes a rerelease of the 1/7th scale figure of the main character, Link! The unique style of the game's key visual has been brought to life with intricate sculptwork and careful paint to recreate the appearance of shadows and textures in perfect detail; this figure is brimming with high quality for fans of the games.",
        "price": 229.99,
        "Instock": true,
        "collections":["Nintendo","The Legend of Zelda"],
        "features":["7.87 inches (20cm)","1/7 Scale","Made of PVC","Based on The Legend of Zelda: Skyward Sword","Includes base"],
        "contents":["Link figure","Base"],
        "portrait_image":"/images/Link.png",
        "landscape_image":"/images/PunkSpidermanAction.png"
    },
    {
        "id": 14,
        "name": "Toy Story Legacy of Revoltech KD-060 Buzz Lightyear (Ver. 1.5)",
        "character":"Buzz Lightyear",
        "description":"A figure of Buzz Lightyear from Toy Story",
        "details": "Toy Story's Buzz Lightyear returns to the Legacy of Revoltech series! Measuring almost 5 inches tall, he features 19 points of articulation, different facial expressions, wing parts, a Squeeze Toy Alien figure, and 3 Green Army Men figures to recreate scenes from the classic animated film.",
        "price": 79.99,
        "Instock": true,
        "collections":["Disney","Pixar"],
        "features":["4.92 inches (12.5cm)","Made of PVC and ABS","From the Toy Story animated movies","Part of the Legacy of Revoltech series","Features 19 points of articulation, facial expressions, wing parts, and other toy accessories"],
        "contents":["Buzz Lightyear figure","4 Face plates","2 Wing parts","Squeeze Toy Alien figure","3 Green Army Men figures","Name plate"],
        "portrait_image":"/images/Buzz.png",
        "landscape_image":"/images/BuzzLandscape.png"
    }
]